In [1]:
import pandas as pd

In [2]:
# series

data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
# create a series from dictionary 

data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
series_dict

a    1
b    2
c    3
dtype: int64

In [4]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

In [5]:
# dataframe
# create a dataframe from a dictionary of list

data = {
    'Name':['Navdeep','Jhon','Jack'],
    'Age':[25,30,45],
    'City':['Noida','New York','Chicago']
}

df = pd.DataFrame(data)
df

      Name  Age      City
0  Navdeep   25     Noida
1     Jhon   30  New York
2     Jack   45   Chicago

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
import numpy as np

np.array(df)

array([['Navdeep', 25, 'Noida'],
       ['Jhon', 30, 'New York'],
       ['Jack', 45, 'Chicago']], dtype=object)

In [8]:
# create a dataframe from a list of dictionaries

data = [
    {'Name':'Navdeep', 'Age':25, 'City':'Noida'},
    {'Name':'John', 'Age':35, 'City':'New York'},
    {'Name':'Jack', 'Age':30, 'City':'Chicago'}
]

pd.DataFrame(data)

      Name  Age      City
0  Navdeep   25     Noida
1     John   35  New York
2     Jack   30   Chicago

In [9]:
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [10]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [15]:
# accessing data from dataframe

df = pd.DataFrame(data)

In [16]:
df['Name']

0    Navdeep
1       John
2       Jack
Name: Name, dtype: object

In [17]:
type(df['Name'])

pandas.core.series.Series

In [20]:
df.loc[0][0]

/var/folders/yz/s57wsyt918j04kt6btpgwgy40000gn/T/ipykernel_33071/2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Navdeep'

In [23]:
df.iloc[0]['Name']

'Navdeep'

In [24]:
# accessing a specified element
df['Name']

0    Navdeep
1       John
2       Jack
Name: Name, dtype: object

In [25]:
df.at[1,'Age']

np.int64(35)

In [26]:
df

      Name  Age      City
0  Navdeep   25     Noida
1     John   35  New York
2     Jack   30   Chicago

In [27]:
df.at[2, 'Name']

'Jack'

In [29]:
# using iat

df.iat[2, 1]

np.int64(30)

In [32]:
df[df['Age'] > 30].iloc[:]

   Name  Age      City
1  John   35  New York

In [33]:
# data manipulation

df

      Name  Age      City
0  Navdeep   25     Noida
1     John   35  New York
2     Jack   30   Chicago

In [38]:
# adding a column
df['Salary'] = [50000,60000,70000]
df

      Name  Age      City  Salary
0  Navdeep   25     Noida   50000
1     John   35  New York   60000
2     Jack   30   Chicago   70000

In [39]:
# removing a column
df.drop('Salary', axis=1, inplace=True)
df

      Name  Age      City
0  Navdeep   25     Noida
1     John   35  New York
2     Jack   30   Chicago

In [40]:
# add age to the column
df['Age'] = df['Age'] + 1
df

      Name  Age      City
0  Navdeep   26     Noida
1     John   36  New York
2     Jack   31   Chicago

In [41]:
df.drop(0, inplace=True)
df

   Name  Age      City
1  John   36  New York
2  Jack   31   Chicago

In [42]:
df = pd.read_csv('data.csv')
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [43]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [44]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000